<script setup>

</script>

<template>
  <main>
    <h1>这是主页</h1>
    <div class="testdiv">
      <input type="text">
      <h2>你好世界</h2>
      <h2>你好世界</h2>
      <h2>你好世界</h2>
      <h2>你好世界</h2>
      <h2>你好世界</h2>
      <h2>你好世界</h2>
      <h2>你好世界</h2>
      <h2>你好世界</h2>
      <h2>你好世界</h2>
      <h2>你好世界</h2>
      <h2>你好世界</h2>
      <h2>你好世界</h2>
      <h2>你好世界</h2>
      <h2>你好世界</h2>
      <h2>你好世界</h2>
      <h2>你好世界</h2>
      <h2>你好世界</h2>
      <h2>你好世界</h2>
      <h2>你好世界</h2>
      <h2>你好世界</h2>
      <h2>你好世界</h2>
      <h2>你好世界</h2>
      <h2>你好世界</h2>
      <h2>你好世界</h2>
      <h2>你好世界</h2>
      <h2>你好世界</h2>
      <h2>你好世界</h2>
      <h2>你好世界</h2>
      <h2>你好世界</h2>
      <h2>你好世界</h2>
      <h2>你好世界</h2>
      <h2>你好世界</h2>
      <h2>你好世界</h2>
      <h2>你好世界</h2>
      <h2>你好世界</h2>
      <h2>你好世界</h2>
      <h2>你好世界</h2>
      <h2>你好世界</h2>
      <h2>你好世界</h2>
      <h2>你好世界</h2>
      <h2>你好世界</h2>
      <h2>你好世界</h2>
      <h2>你好世界</h2>
      <h2>你好世界</h2>
      <h2>你好世界</h2>
      <h2>你好世界</h2>
      <h2>你好世界</h2>
      <h2>你好世界</h2>
      <h2>你好世界</h2>
      <h2>你好世界</h2>
      <h2>你好世界</h2>
      <h2>你好世界</h2>
      <h2>你好世界</h2>
      <h2>你好世界</h2>
      <h2>你好世界</h2>
      <h2>你好世界</h2>
      <h2>你好世界</h2>
      <h2>你好世界</h2>
      <h2>你好世界</h2>
      <h2>你好世界</h2>
      <h2>你好世界</h2>
      <h2>你好世界</h2>
      <h2>你好世界</h2>
      <h2>你好世界</h2>
      <h2>你好世界</h2>
      <h2>你好世界</h2>
      <h2>你好世界</h2>
      <h2>你好世界</h2>
      <h2>你好世界</h2>
      <h2>你好世界</h2>
      <h2>你好世界</h2>
      <h2>你好世界</h2>
      <h2>你好世界</h2>
      <h2>你好世界</h2>
      <h2>你好世界</h2>
      <h2>你好世界</h2>
      <h2>你好世界</h2>
      <h2>你好世界</h2>
      <h2>你好世界</h2>
      <h2>你好世界</h2>
      <h2>你好世界</h2>
      <h2>你好世界</h2>
      <h2>你好世界</h2>
      <h2>你好世界</h2>
      <h2>你好世界</h2>
      <h2>你好世界</h2>
      <h2>你好世界</h2>
      <h2>你好世界</h2>
      <h2>你好世界</h2>
      <h2>你好世界</h2>
      <h2>你好世界</h2>
      <h2>你好世界</h2>
      <h2>你好世界</h2>
      <h2>你好世界</h2>
      <h2>你好世界</h2>
      <h2>你好世界</h2>
      <h2>你好世界</h2>
      <h2>你好世界</h2>
      <h2>你好世界</h2>
    </div>
  </main>
</template>

<style scoped>
main {
  width: 100%;
}

.testdiv {
  height: 100vh;
}
</style>